database/mysql-tool.org
#+TITLE: MySQL 工具使用笔记
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2022-11-03 Thu 10:19:36>
#+HTML_LINK_UP: ../readme.html
#+HTML_LINK_HOME: ../index.html
#+SETUPFILE: ~/.emacs.d/site-lisp/org-html-themes/setup/theme-readtheorg-local.setup
#+PROPERTY: header-args:sql :database test01 :engine mysql :exports both
#+OPTIONS: ^:nil
#+TAGS: mysql


* 索引
** explain 工具
直接通过在 query 的前面添加 ~explain~ 关键字就可以得到查询计划

#+BEGIN_SRC sql
  explain select * from t;
#+END_SRC

#+RESULTS:
| id | select_type | table | partitions | type | possible_keys | key  | key_len | ref  | rows | filtered | Extra |
|----+-------------+-------+------------+------+---------------+------+---------+------+------+----------+-------|
|  1 | SIMPLE      | t     | NULL       | ALL  | NULL          | NULL | NULL    | NULL |    6 |   100.00 | NULL  |

** 使用 optimize trace 工具
开启 optimize trace 工具，先开启配置项，结果在 ~information_schema.optimizer_trace~ 查看结果

#+BEGIN_SRC sql
  set optimizer_trace="enabled=on";
  select count(*) from t;
  select * from information_schema.optimizer_trace\G
#+END_SRC

#+BEGIN_SRC json
  {
    "steps": [
      {
        "join_preparation": {
          "select#": 1,
          "steps": [
            {
              "expanded_query": "/* select#1 */ select count(0) AS `count(*)` from `t`"
            }
          ]
        }
      },
      {
        "join_optimization": {
          "select#": 1,
          "steps": [
            {
              "table_dependencies": [
                {
                  "table": "`t`",
                  "row_may_be_null": false,
                  "map_bit": 0,
                  "depends_on_map_bits": [
                  ]
                }
              ]
            },
            {
              "rows_estimation": [
                {
                  "table": "`t`",
                  "table_scan": {
                    "rows": 6,
                    "cost": 0.25
                  }
                }
              ]
            },
            {
              "considered_execution_plans": [
                {
                  "plan_prefix": [
                  ],
                  "table": "`t`",
                  "best_access_path": {
                    "considered_access_paths": [
                      {
                        "rows_to_scan": 6,
                        "access_type": "scan",
                        "resulting_rows": 6,
                        "cost": 0.85,
                        "chosen": true
                      }
                    ]
                  },
                  "condition_filtering_pct": 100,
                  "rows_for_plan": 6,
                  "cost_for_plan": 0.85,
                  "chosen": true
                }
              ]
            },
            {
              "attaching_conditions_to_tables": {
                "original_condition": null,
                "attached_conditions_computation": [
                ],
                "attached_conditions_summary": [
                  {
                    "table": "`t`",
                    "attached": null
                  }
                ]
              }
            },
            {
              "optimizing_distinct_group_by_order_by": {
              }
            },
            {
              "finalizing_table_conditions": [
              ]
            },
            {
              "refine_plan": [
                {
                  "table": "`t`"
                }
              ]
            },
            {
              "considering_tmp_tables": [
              ]
            }
          ]
        }
      },
      {
        "join_execution": {
          "select#": 1,
          "steps": [
          ]
        }
      }
    ]
  }
#+END_SRC


* mysql
** pager
开启 pager
#+BEGIN_SRC sql
  mysql> pager less
  PAGER set to 'less'
#+END_SRC

关闭 pager
#+BEGIN_SRC sql
  mysql> \n
  PAGER set to stdout
#+END_SRC
